package utils;

import com.alibaba.fastjson.JSONArray;
import com.alibaba.fastjson.JSONObject;

import java.io.File;
import java.io.FileInputStream;
import java.util.*;

public class Sogou {
    /**
     * @return eg.
     * [
     * {
     * "data": ["阿尔塞斯", "阿卡瑟德刺人", "阿卡瑟德掘地者", "阿卡瑟德主", "阿卡瑟德战士", "阿利亚之笛", "艾尼之优", "矮人火枪手", "矮人狙击手", "矮人直升机", "矮人直升机炸弹", "艾西的古祭祀", "暗", "暗游侠", "灭", "灭匀", "灭刃", "暗牧", "暗夜精灵形态", "暗夜老农", "暗夜魔王", "暗影", "暗影猎手", "暗影猎手小", "暗影牧师", "暗影萨满", "暗影突", "拔线", "白虎", "白牛", "板甲", "半人马刺客", "半人马弓箭手", "半人马可汗", "半人马工", "半人马酋长", "半人马巫师", "半人马先行者", "半人猛犸", "半兽人之斧", "保护卷轴", "保护地", "包鸡", "暴击", "暴怒枭兽", "保塔", "爆小", "包眼", "暴走", "兽", "章", "蝙蝠士", "变", "变战", "变体攻击", "变体精灵", "变相移动", "变熊", "变羊", "变异两栖人", "变程", "标准战役区", "冰冻喷吐", "冰冻之箭", "冰封禁锢", "冰封禁制", "冰封径", "冰火交加", "冰甲", "冰箭", "冰魔级牧师", "冰魔狂战士", "冰魔猎手", "冰魔", "冰魔影子牧师", "冰女", "冰牙猛犸", "冰眼", "兵营", "冰之巨魔", "波浪形态", "补兵", "补兵斧", "补匀", "补匀斧", "不叠加", "补盾", "不给分", "不可侵犯", "补魔", "不升级基地", "不死盾", "不死族老农", "补塔", "不稳定化合物", "不朽", "不朽盾", "不朽尸王", "不朽之守护", "补血", "补眼", "操纵死尸", "操纵死尸卷轴", "插棒子", "查克拉魔法", "插", "叉形电", "插眼", "叉状电", "拆塔", "缠绕", "缠绕矿", "长衣", "长管火枪", "长矛", "长矛手", "长年熊", "强力", "声冲击波", "潮汐", "潮汐猎人", "沉沦之海", "沉光环", "沉魔法", "沉术士", "沉杖", "尘土之影", "晨之酒", "澄海落中华阁", "澄海十大狂人", "城甲", "城镇大厅", "吃兵", "炽魂替换", "吃尸", "吃树", "吃小兵", "冲击波", "生", "冲他", "出", "初夜男", "穿刺攻击", "穿刺剑刃", "传哥", "传送权杖", "传送逃", "穿他", "吹流", "吹杖", "纯暴流", "纯狗流", "刺扫射", "丛林守护者", "大电锤", "打点", "打盾", "大法", "大法师", "大复活神符", "大根", "贡", "贡之神力", "大回复卷轴", "大恢复药水", "大魔法神符", "大魔法药水", "大娜", "大炮", "打泉水", "大生命药水", "大师级利爪徳依练", "大师级灵魂行者练", "大师级猛禽徳依练", "大师级牧师练", "大师级女巫练", "大师级女妖练", "大师级萨满练", "大师级亡灵巫师练", "大师级巫医练", "大树", "打塔", "打", "搭载弓箭手", "大治疗神符", "大然的掩护", "带刺外壳", "带粉", "带眼", "弹幕攻击", "单杀", "单中", "导弹轰炸", "到六", "匀阵旋", "德伊", "地卜", "地卜师", "敌法", "敌法师", "地精", "地精船厂", "地精的贪婪", "地精艇", "地精工兵", "地精炼术士", "地精商店", "地精实室", "地精撕者", "地精修补匠", "低维修费用", "地穴", "地穴编织者", "地穴刺客", "地穴狗头人", "地穴主", "地穴主小强", "地穴主小强阿巴拉克", "地狱火", "地狱火球", "地狱火之石", "地狱主", "电棍", "电魂", "点", "点手", "电", "电子咆哮", "电子屏", "丢锤", "丢个锤", "动力", "动物信使", "动物作战练", "来", "来上", "来下", "来中", "毒标", "毒", "毒去抓人", "毒守卫", "毒性攻击", "毒性树人", "毒液之球", "毒液蜘", "短棍", "对抗地图", "对尸体有效", "多", "多箭矢", "多施法", "堕落牧师", "堕落树人", "恶魔匀", "恶魔匀锋", "恶魔猎手", "恶魔猎手伊利丹", "恶魔巫师", "恩赐脱", "二塔", "法力丢失", "法力流失", "法力燃烧", "法力损毁", "法力虚空", "法球", "法球效果", "法球效果不叠加", "法师长", "法术护盾", "反补", "反魔法盾", "反弹甲", "范围沉", "放刺", "放沟", "放鸟", "放", "放眼", "斧", "", "行信使", "沸血之矛", "分离弓箭手和鹰兽", "分攻击", "分箭", "分", "分斧", "粉碎伤害", "粉碎者", "暴锤", "暴祭坛", "暴巨", "暴狮", "暴乌鸦", "暴战锤", "暴召唤", "暴之锤", "暴之灵", "德", "疯狂面具", "猫", "封水道", "熊猫", "封", "杖", "复仇电魂", "腐蜂群", "复仇天神", "复仇之魂", "复活盾", "复活十字架", "复活死尸", "腐堆积", "蝮突", "腐尸甲虫", "腐喷吐", "腐外表", "腐之球", "斧王", "", "刚", "兽", "刚兽", "刚猪", "刚毛后", "岗哨神符", "岗哨守卫", "维修费用", "哥布林工程师", "攻城攻击", "攻城傀儡", "工程学升级", "攻击之爪", "弓箭手", "共享鸡鸡", "共享小鸡", "弓星", "狗头", "狗头人", "狗头人", "狗头人占卜者", "子", "古尔丹", "法", "弓", "佣兵营地", "古之忍耐姜歌", "质增强术", "挂件", "关圣殿", "光法", "光明游侠", "光明游侠小白", "光守", "光侠箭", "光之箭", "光之酒", "光之守卫", "贵族圆环", "海娜", "海妖", "寒冰碎片", "撼地神牛", "浩方", "豪猪猎手", "河道男", "河道女", "合个心", "暗巨魔", "暗时", "暗巫师", "暗贤者", "暗仪式", "暗游侠", "暗游侠小", "暗之箭", "暗之奴", "暗之球", "店", "弓", "皇", "皇杖", "魔级牧师", "魔狂战士", "魔猎手", "魔影子牧师", "鸟", "曜毁灭者", "红之卵", "红杖", "吼啊", "猴王杖", "吼伀下", "吼伀下子", "护盾神符", "虎妹", "虎妞", "互通图", "弧形电", "岗岩傀儡", "化学狂暴", "幻刺", "换来", "幻化之锋", "幻火", "换人", "换属性", "换他啊", "换位女", "幻象", "幻象法球", "换血", "欢欣匀", "欢欣之刃", "幻影", "幻影长矛手", "幻影刺客", "幻影斧", "幻影神符", "蝗虫群", "点", "昏酒", "回城", "回城卷", "回城卷轴", "回到去", "回防", "回复戒指", "回复卷轴", "恢复卷轴", "回复神符", "回复头巾", "煌光环", "毁灭守卫", "毁灭之", "毁灭之球", "毁灭蜘流", "", "回击", "混沌", "混沌士", "混乱攻击", "混乱之治", "魂守", "魂手", "混线", "活力之球", "祸乱之源", "火女", "火枪", "火枪流", "火枪手", "活体护甲", "火土暴", "火焰爆轰", "火焰呼吸", "火焰巨魔炎魔", "火焰主", "火焰气息", "火焰", "火焰之球", "吉安娜", "鸡巴脸", "几八脸", "疾病云", "系带", "疾步", "极寒域", "祭品", "机器人的军", "机器人军", "极限法球", "机械地精", "加盐", "加甲", "加魔", "假", "加速神符", "加速手套", "假腿", "假眼", "尖刺外壳", "健康之石", "尖毛兽酋长", "尖毛兽人", "尖毛兽医生", "尖毛兽侦察兵", "剑刃暴", "坚光环", "坚球", "溅射", "剑圣", "剑圣格罗姆地狱咆哮", "减速", "减速光环", "减速效果无魔法免疫", "绞车", "鹰", "鹰兽", "鹰兽士", "浸毒标枪", "箍棒", "禁魔", "静电场", "净化", "净化匀", "净化药水", "荆棘光环", "精灵老农", "精灵", "精灵皮靴", "精灵之火", "静咒", "精气之球", "镜像", "经之书", "纠缠根须", "剧毒", "剧毒术士", "巨力挥击", "巨力挥舞", "巨魔", "巨魔蝙蝠士", "巨魔狂暴战士", "巨魔猎头者", "巨魔巫医", "巨魔再生", "巨魔战将", "巨人力腰带", "巨熊形态", "卡德医疗宝石", "卡尔", "卡尔的复仇", "卡尔萨斯", "卡嘉长笛", "卡嘉长萧", "怀不败", "怀攻速", "怀圣殿", "怀", "抗体药水", "抗性皮", "克敌机先", "科勒恩的逃脱匕", "恐怖嚎叫", "恐怖猛犸", "恐怖之狼", "恐惧魔王", "恐惧之狼", "空明杖", "控魔", "控线", "空中枷锁", "口工厂", "扣子妹", "弓", "海", "射手", "王", "掌控", "枯萎精", "狂暴洗劫者", "狂热光环", "狂性枭兽", "狂战斧", "狂战士之怒", "狂战士之血", "狂战拯救世界", "奎尔萨拉斯之靴", "奎尔瑟兰的密室", "捆人", "捆他", "捆住", "阔剑", "拉", "来中推", "猫", "", "子", "瓶", "熊猫", "杖", "狼人", "老鹿", "老树", "锤", "电牵引", "霆蜥蜴", "霆伀击", "力手套", "力型", "力腰带", "明酒", "利爪德伊", "利爪之痕", "环电", "环霜冻", "炼", "炼术士", "练术士", "两级反转", "两栖者", "两栖人猎手", "两栖者", "两栖夜行者", "两栖者", "两栖踪者", "魂人", "猎手大厅", "猎头流", "烈焰暴", "林法球", "林球", "灵动之翼", "灵魂归宿", "灵魂燃烧", "灵魂守卫", "灵魂行者", "灵魂之矛", "灵魂之猪", "灵陷阱", "灵之刃", "灵巧头巾", "灵守", "流浪法师斗篷", "流浪剑客", "流氓巫师", "留人", "卵盗贼", "卵主", "卵学徒", "卵战士", "破斩", "", "士", "心", "之男巫", "族血统", "落日酒", "洛萨", "洛萨之锋", "绿蜉蝣", "绿幼", "痹陷阱", "玛格娜托破坏者", "玛格娜托撕者", "玛格娜托战士", "妈奶崩", "马蹄踏", "玛维", "埋布地", "斯之手", "埋地", "买活", "斯琪女士", "买眼", "魅惑", "魅惑魔女", "魅惑遗物", "梅", "梅斯姆", "没有分", "梦境缠绕", "猛犸", "猛禽德伊", "猛禽之痕", "秘法", "秘法圣所", "秘法指环", "秘术异", "谜团", "秘锤", "秒逼", "秒", "秒秒射", "敏件", "敏捷便", "敏捷型", "冥界亚", "命令光环", "魔棒", "尔基安的章", "魔法垂饰", "魔法盗取权杖", "魔法盾", "魔法反", "魔法护盾", "魔法护盾护符", "魔法箭", "魔法结界", "魔法抗性", "魔法免疫", "魔法破坏者", "魔法", "魔法伤害", "魔法吮吸", "魔法吸收", "魔法药水", "魔法之球", "魔抗", "魔力法杖", "魔之心", "魔免", "魔瓶", "魔器传送", "末日使者", "末日守卫", "魔兽战队", "魔血球", "暮色酒", "娜", "娜海妖", "娜女海巫", "娜女海妖", "耐奥祖", "耐久光环", "鬼矿", "内面罩男", "垂饰", "之球", "之书", "你捡", "泥潭傀儡", "粘稠鼻液", "宁静之", "牛头", "牛头人", "牛头人酋长", "牛头人酋长凯恩血蹄", "牛头人图腾", "怒意狂击", "女猎流", "女猎手", "击炮小队", "拍拍熊", "什么", "撇锤", "撇斧", "撇斧子", "瓶色药水", "破法", "破法点灯", "破法者", "普通伤害", "乘鹰兽", "奇美拉栖木", "崎岖外表", "士加狮鹫", "强盗主", "强化图腾", "强化战鼓", "强击光环", "抢人头", "强杀", "强", "强甲", "敲地板", "清兵", "清晨酒", "青蜉蝣", "青幼", "穷鬼盾", "驱魔神符", "驱散", "驱散模范", "劝化", "全域静", "全士", "全屏沉", "全屏", "全图", "全知浮", "群魔缠", "群守卫", "群体传送", "群星坠落", "燃灰", "燃烧汽油", "绕树林", "热导弹", "刃甲", "人类联盟", "人类联盟区", "人品真好", "人仗熊势", "人族老农", "人族万油", "人族伀波流", "扔锤", "扔人", "日出酒", "盾", "山", "撒旦之力", "洒粉", "萨格拉斯之眼", "萨满", "萨满祭司", "赛特斯", "赛特斯之地狱使者", "赛特斯之暗舞者", "赛特斯之灵魂盗贼", "赛特斯之魔法师", "散华", "散华夜叉", "散失", "散失之刃", "三塔", "散夜", "散夜对剑", "森林巨魔", "森林之眼", "沙王", "避", "避护符", "电盾牌", "电箭阵", "电", "电咆哮", "电权杖", "电蜥蜴", "电幽魂", "电之球", "光弹", "山岭", "山岭巨人", "山丘之山", "山丘之王", "山丘之王穆拉丁", "烁突", "山王", "上单", "伤害加深", "赏猎人", "上", "上单", "上有符", "上有符", "烧魔", "棒", "棒子", "发魔女", "发女妖", "射击术", "女", "射手天赋", "神符", "神符上", "神符下", "神灵", "神灵武士", "神秘宝室", "神秘法杖", "神秘圣地", "神灭斩", "神牛", "神圣法杖", "神圣护甲", "神圣劝化", "神圣伤害", "神圣药水", "神圣之光", "深渊主", "深渊魔王", "神杖", "神之力", "神", "神流", "圣殿指环", "圣光", "升级狂战士", "圣剑", "生命护符", "生命回复", "生命手册", "生命吮吸", "生命吸取", "生命药水", "生命之泉", "圣", "圣士", "圣士乌瑟尔", "圣堂", "圣堂刺客", "圣物关口", "圣者遗物", "时光蜘", "石化凝", "时结界", "时漫游", "时锁定", "狮鹫笼", "狮鹫士", "人魔法师", "人魔力手套", "人魔魔法师", "人魔手套", "侍僧", "尸", "尸鬼", "尸鬼章", "尸鬼狂热", "尸鬼王章", "石头人", "尸王", "石像形态", "嗜血", "嗜血牛头流", "守地", "守护指环", "收尸体", "兽人步兵", "兽人地洞", "兽人斧", "守塔", "兽王", "守望者玛维", "手选", "受折磨的灵魂", "兽之狂暴", "兽族步兵", "兽族落", "兽族老农", "树根缠绕", "曙光酒", "树精卫士", "树魔级牧师", "树魔狂战士", "树魔猎手", "树魔", "树魔影子牧师", "术士", "属性点", "属性附加", "树眼", "赎罪", "刷新球", "刷", "双倍", "双倍攻击", "双倍攻击神符", "双倍神符", "霜冻护甲", "霜冻新星", "霜冻之箭", "霜冻之球", "双刃剑", "双头", "双头", "霜之新星", "双", "水晶阿卡瑟德", "水晶剑", "水晶室女", "水人", "四保伀", "斯嘉之眼", "撕伤口", "死灵", "死灵法", "死灵法师", "死灵", "死灵", "死灵书", "死", "死亡缠绕", "死亡凋", "死亡面具", "死亡面罩", "死亡士", "死亡士阿尔赛斯", "死亡守卫", "死亡先知", "死亡伀指", "死亡掌控", "速度卷轴", "速度神符", "速度之靴", "速推", "酸性喷", "酸性炸弹", "碎锤", "碎片攻击", "塔类图", "探测形", "弹射法杖", "淘汰之刃", "套套子", "逃脱匕", "提升力型", "天地鬼", "天地双鬼", "天神下凡", "天灾", "天灾军团的末日", "啊", "匀", "挑战头巾", "树枝干", "意头盔", "痛尖叫", "痛女王", "痛之源", "通灵塔", "头巾", "投矛", "透明鹿", "偷泉水", "投刃车", "偷塔", "投掷", "投掷镖", "屠夫", "屠夫去抓人", "图斯卡尔格斗者", "图斯卡尔猎人", "图斯卡尔男巫", "图斯卡尔枪兵", "图斯卡尔酋长", "图斯卡尔巫师", "图斯卡尔战士", "土熊猫", "团控", "化光环", "推塔", "推推杖", "推中", "吞噬", "吞噬魔法", "挖掘尸体", "万火焚", "亡灵的入侵", "亡灵法师", "亡灵巫师", "网住", "微恢复药水", "维拉德卖的赠品", "我单", "无敌暗猎人", "无敌暗舞者", "无敌狂暴者", "无敌斩", "巫毒商店", "无光之盾", "无甲", "无名恐怖者", "无名士", "无名死灵", "无虐不成长", "武器商人比泽", "巫师变者", "无地形", "无魔法免疫", "巫师学徒", "巫术之杖", "无维修费用", "巫妖", "巫妖克尔加德", "午夜凋", "午夜酒", "巫医", "无用挂件", "无缘无尽", "西尔瓦娜斯", "希梅斯特的掠夺", "牺牲深渊", "西瓦的守护", "希娃的守护", "希瓦的守护", "吸血光环", "吸血鬼的祭品", "吸血面具", "吸血药水", "蜥蜴怪物", "下单", "下有符", "下有符", "先锋盾", "陷阱守卫", "仙女", "先网", "显影之尘", "贤者", "先知", "相位", "相位转移", "小德", "小电锤", "小复活神符", "效果无魔法免疫", "小", "小回复卷轴", "小恢复药水", "小净化", "小净化药水", "小", "小", "小鹿", "消魔", "小魔棒", "小魔法神符", "小娜", "小炮", "小强蜘流", "小歪", "小小", "小丫", "小治疗神符", "小蜘", "恶光环", "恶狂热", "恶镰匀", "恶漫步者", "恶撒旦之力", "恶执著", "卸下尸体", "心灵之火", "新月之痕", "熊德", "熊怪萨满", "熊怪萨满长者", "熊怪", "熊怪乌萨战士", "熊怪踪者", "熊灵", "熊鹿", "熊鹿流", "熊猫酒仙", "熊形态", "熊战", "熊战士", "修补", "修补匠", "秀逗", "秀逗魔导士", "秀逗魔导师", "虚空", "虚空假面", "虚无宝石", "虚无状态", "玄冥盾牌", "血法师", "血精", "血精石", "穴居恶魔", "血魔", "血魔球", "血浴之母", "压兵线", "亚", "压人", "压线", "压制", "压制之刃", "岩石傀儡", "岩石印", "羊匀", "养人", "羊杖", "遥控炸弹", "摇瓶子", "妖术", "夜魔", "夜幕中的狩猎者", "兽幽魂", "液态火", "夜晚狩猎者", "性呼唤", "性之斧", "夜之酒", "伀拨", "伀波流", "医疗波", "医疗剂", "艺人面罩", "伀塔", "遗忘法师", "移形换位", "伀血", "啊", "刺", "匀", "神符", "药水", "形刺客", "阴影之狼", "硬化皮", "鹰弓", "影魔", "鹰女妖暴巫师", "鹰女妖流氓", "鹰女妖女皇", "鹰女妖巫婆", "攻击", "海", "影压", "勇头盔", "永恒之树", "永久", "捕", "幽鬼", "幽魂权杖", "幽灵系带", "幽灵之狼", "幽冥剧毒", "幽冥伀击", "游侠", "有眼", "玉蝴蝶流", "母蜘", "淤泥怪物", "淤泥投手", "淤泥战士", "鱼人", "鱼人守卫", "鱼人碎击", "圆盾", "古兵器", "古神灵", "古之树", "原始咆哮", "元素分离", "元素熊猫", "行", "月井", "月亮女祭祀", "月女", "月", "月神箭", "月神之箭", "月", "塔强杀", "月之女祭师泰兰德", "月之女祭司", "月之女祭祀", "月之士", "晕锤", "灾祸树人", "再填", "凿他", "怎么不换", "憎恶毁灭流", "炸弹人", "战斗嚎叫", "战歌之鼓", "战争古树", "战争踏", "战争傀儡", "战争磨坊", "召唤豪猪", "召唤师", "召唤树人", "召唤熊", "召唤熊灵", "召唤岩浆怪", "召唤战鹰", "召民兵", "招猪", "折光", "侦察守卫", "振奋", "振奋宝石", "振魂石", "真形态", "真", "真", "真宝石", "真实", "真眼", "正补", "汽坦克", "智慧披", "智慧之刃", "智力斗篷", "智力型", "治疗卷轴", "治疗喷", "治疗权仗", "治疗神符", "治疗守卫", "治疗指环", "命伀击", "支配头盔", "制图教学", "制图资源", "支援法衣", "蜘流", "忠考", "中单", "中和权杖", "击", "中立", "中", "中单", "中回来", "中消失", "众神", "众神之王", "中推", "主机刷", "网", "网怪女皇", "网怪", "网怪者", "网怪战士", "网怪织网者", "抓人", "专家级利爪德依练", "专家级灵魂行者练", "专家级猛禽德依练", "专家级牧师练", "专家级女巫练", "专家级女妖练", "专家级萨满练", "专家级亡灵巫师练", "专家级巫医练", "专注光环", "备唯伀", "踪术", "灼热之箭", "爆", "爆男", "动之火", "然之怒", "然之助", "紫怨", "紫怨之杖", "走位", "地", "栀后遗", "酒云"],
     * "wordBankName": "dota DOTA【官方推荐】",
     * "type": "魔兽争霸"
     * }
     * ]
     * @throws Exception
     */
    public static JSONArray getData() throws Exception {
        //System.out.println(getDateFromSCEL("C:\\Users\\Administrator\\Desktop\\11\\海贼王.scel"));
        File file = new File("");
        String path = file.getAbsolutePath() + File.separator + "conf" + File.separator + "wordBankFiles";
        File parent = new File(path);
        File[] sunFileList = parent.listFiles();
        JSONArray datas = new JSONArray();
        for (int i = 0; i < sunFileList.length; i++) {
            if (sunFileList[i].isFile()) {
                datas.add(getDateFromSCEL(sunFileList[i].getAbsolutePath()));
                //files.add(sunFileList[i].getName());
            }
        }
        //System.out.println(datas);
        return datas;
    }

    /**
     * @param path
     * @return eg.
     * {
     * "data": ["阿尔塞斯", "阿卡瑟德刺人", "阿卡瑟德掘地者", "阿卡瑟德主", "阿卡瑟德战士", "阿利亚之笛", "艾尼之优", "矮人火枪手", "矮人狙击手", "矮人直升机", "矮人直升机炸弹", "艾西的古祭祀", "暗", "暗游侠", "灭", "灭匀", "灭刃", "暗牧", "暗夜精灵形态", "暗夜老农", "暗夜魔王", "暗影", "暗影猎手", "暗影猎手小", "暗影牧师", "暗影萨满", "暗影突", "拔线", "白虎", "白牛", "板甲", "半人马刺客", "半人马弓箭手", "半人马可汗", "半人马工", "半人马酋长", "半人马巫师", "半人马先行者", "半人猛犸", "半兽人之斧", "保护卷轴", "保护地", "包鸡", "暴击", "暴怒枭兽", "保塔", "爆小", "包眼", "暴走", "兽", "章", "蝙蝠士", "变", "变战", "变体攻击", "变体精灵", "变相移动", "变熊", "变羊", "变异两栖人", "变程", "标准战役区", "冰冻喷吐", "冰冻之箭", "冰封禁锢", "冰封禁制", "冰封径", "冰火交加", "冰甲", "冰箭", "冰魔级牧师", "冰魔狂战士", "冰魔猎手", "冰魔", "冰魔影子牧师", "冰女", "冰牙猛犸", "冰眼", "兵营", "冰之巨魔", "波浪形态", "补兵", "补兵斧", "补匀", "补匀斧", "不叠加", "补盾", "不给分", "不可侵犯", "补魔", "不升级基地", "不死盾", "不死族老农", "补塔", "不稳定化合物", "不朽", "不朽盾", "不朽尸王", "不朽之守护", "补血", "补眼", "操纵死尸", "操纵死尸卷轴", "插棒子", "查克拉魔法", "插", "叉形电", "插眼", "叉状电", "拆塔", "缠绕", "缠绕矿", "长衣", "长管火枪", "长矛", "长矛手", "长年熊", "强力", "声冲击波", "潮汐", "潮汐猎人", "沉沦之海", "沉光环", "沉魔法", "沉术士", "沉杖", "尘土之影", "晨之酒", "澄海落中华阁", "澄海十大狂人", "城甲", "城镇大厅", "吃兵", "炽魂替换", "吃尸", "吃树", "吃小兵", "冲击波", "生", "冲他", "出", "初夜男", "穿刺攻击", "穿刺剑刃", "传哥", "传送权杖", "传送逃", "穿他", "吹流", "吹杖", "纯暴流", "纯狗流", "刺扫射", "丛林守护者", "大电锤", "打点", "打盾", "大法", "大法师", "大复活神符", "大根", "贡", "贡之神力", "大回复卷轴", "大恢复药水", "大魔法神符", "大魔法药水", "大娜", "大炮", "打泉水", "大生命药水", "大师级利爪徳依练", "大师级灵魂行者练", "大师级猛禽徳依练", "大师级牧师练", "大师级女巫练", "大师级女妖练", "大师级萨满练", "大师级亡灵巫师练", "大师级巫医练", "大树", "打塔", "打", "搭载弓箭手", "大治疗神符", "大然的掩护", "带刺外壳", "带粉", "带眼", "弹幕攻击", "单杀", "单中", "导弹轰炸", "到六", "匀阵旋", "德伊", "地卜", "地卜师", "敌法", "敌法师", "地精", "地精船厂", "地精的贪婪", "地精艇", "地精工兵", "地精炼术士", "地精商店", "地精实室", "地精撕者", "地精修补匠", "低维修费用", "地穴", "地穴编织者", "地穴刺客", "地穴狗头人", "地穴主", "地穴主小强", "地穴主小强阿巴拉克", "地狱火", "地狱火球", "地狱火之石", "地狱主", "电棍", "电魂", "点", "点手", "电", "电子咆哮", "电子屏", "丢锤", "丢个锤", "动力", "动物信使", "动物作战练", "来", "来上", "来下", "来中", "毒标", "毒", "毒去抓人", "毒守卫", "毒性攻击", "毒性树人", "毒液之球", "毒液蜘", "短棍", "对抗地图", "对尸体有效", "多", "多箭矢", "多施法", "堕落牧师", "堕落树人", "恶魔匀", "恶魔匀锋", "恶魔猎手", "恶魔猎手伊利丹", "恶魔巫师", "恩赐脱", "二塔", "法力丢失", "法力流失", "法力燃烧", "法力损毁", "法力虚空", "法球", "法球效果", "法球效果不叠加", "法师长", "法术护盾", "反补", "反魔法盾", "反弹甲", "范围沉", "放刺", "放沟", "放鸟", "放", "放眼", "斧", "", "行信使", "沸血之矛", "分离弓箭手和鹰兽", "分攻击", "分箭", "分", "分斧", "粉碎伤害", "粉碎者", "暴锤", "暴祭坛", "暴巨", "暴狮", "暴乌鸦", "暴战锤", "暴召唤", "暴之锤", "暴之灵", "德", "疯狂面具", "猫", "封水道", "熊猫", "封", "杖", "复仇电魂", "腐蜂群", "复仇天神", "复仇之魂", "复活盾", "复活十字架", "复活死尸", "腐堆积", "蝮突", "腐尸甲虫", "腐喷吐", "腐外表", "腐之球", "斧王", "", "刚", "兽", "刚兽", "刚猪", "刚毛后", "岗哨神符", "岗哨守卫", "维修费用", "哥布林工程师", "攻城攻击", "攻城傀儡", "工程学升级", "攻击之爪", "弓箭手", "共享鸡鸡", "共享小鸡", "弓星", "狗头", "狗头人", "狗头人", "狗头人占卜者", "子", "古尔丹", "法", "弓", "佣兵营地", "古之忍耐姜歌", "质增强术", "挂件", "关圣殿", "光法", "光明游侠", "光明游侠小白", "光守", "光侠箭", "光之箭", "光之酒", "光之守卫", "贵族圆环", "海娜", "海妖", "寒冰碎片", "撼地神牛", "浩方", "豪猪猎手", "河道男", "河道女", "合个心", "暗巨魔", "暗时", "暗巫师", "暗贤者", "暗仪式", "暗游侠", "暗游侠小", "暗之箭", "暗之奴", "暗之球", "店", "弓", "皇", "皇杖", "魔级牧师", "魔狂战士", "魔猎手", "魔影子牧师", "鸟", "曜毁灭者", "红之卵", "红杖", "吼啊", "猴王杖", "吼伀下", "吼伀下子", "护盾神符", "虎妹", "虎妞", "互通图", "弧形电", "岗岩傀儡", "化学狂暴", "幻刺", "换来", "幻化之锋", "幻火", "换人", "换属性", "换他啊", "换位女", "幻象", "幻象法球", "换血", "欢欣匀", "欢欣之刃", "幻影", "幻影长矛手", "幻影刺客", "幻影斧", "幻影神符", "蝗虫群", "点", "昏酒", "回城", "回城卷", "回城卷轴", "回到去", "回防", "回复戒指", "回复卷轴", "恢复卷轴", "回复神符", "回复头巾", "煌光环", "毁灭守卫", "毁灭之", "毁灭之球", "毁灭蜘流", "", "回击", "混沌", "混沌士", "混乱攻击", "混乱之治", "魂守", "魂手", "混线", "活力之球", "祸乱之源", "火女", "火枪", "火枪流", "火枪手", "活体护甲", "火土暴", "火焰爆轰", "火焰呼吸", "火焰巨魔炎魔", "火焰主", "火焰气息", "火焰", "火焰之球", "吉安娜", "鸡巴脸", "几八脸", "疾病云", "系带", "疾步", "极寒域", "祭品", "机器人的军", "机器人军", "极限法球", "机械地精", "加盐", "加甲", "加魔", "假", "加速神符", "加速手套", "假腿", "假眼", "尖刺外壳", "健康之石", "尖毛兽酋长", "尖毛兽人", "尖毛兽医生", "尖毛兽侦察兵", "剑刃暴", "坚光环", "坚球", "溅射", "剑圣", "剑圣格罗姆地狱咆哮", "减速", "减速光环", "减速效果无魔法免疫", "绞车", "鹰", "鹰兽", "鹰兽士", "浸毒标枪", "箍棒", "禁魔", "静电场", "净化", "净化匀", "净化药水", "荆棘光环", "精灵老农", "精灵", "精灵皮靴", "精灵之火", "静咒", "精气之球", "镜像", "经之书", "纠缠根须", "剧毒", "剧毒术士", "巨力挥击", "巨力挥舞", "巨魔", "巨魔蝙蝠士", "巨魔狂暴战士", "巨魔猎头者", "巨魔巫医", "巨魔再生", "巨魔战将", "巨人力腰带", "巨熊形态", "卡德医疗宝石", "卡尔", "卡尔的复仇", "卡尔萨斯", "卡嘉长笛", "卡嘉长萧", "怀不败", "怀攻速", "怀圣殿", "怀", "抗体药水", "抗性皮", "克敌机先", "科勒恩的逃脱匕", "恐怖嚎叫", "恐怖猛犸", "恐怖之狼", "恐惧魔王", "恐惧之狼", "空明杖", "控魔", "控线", "空中枷锁", "口工厂", "扣子妹", "弓", "海", "射手", "王", "掌控", "枯萎精", "狂暴洗劫者", "狂热光环", "狂性枭兽", "狂战斧", "狂战士之怒", "狂战士之血", "狂战拯救世界", "奎尔萨拉斯之靴", "奎尔瑟兰的密室", "捆人", "捆他", "捆住", "阔剑", "拉", "来中推", "猫", "", "子", "瓶", "熊猫", "杖", "狼人", "老鹿", "老树", "锤", "电牵引", "霆蜥蜴", "霆伀击", "力手套", "力型", "力腰带", "明酒", "利爪德伊", "利爪之痕", "环电", "环霜冻", "炼", "炼术士", "练术士", "两级反转", "两栖者", "两栖人猎手", "两栖者", "两栖夜行者", "两栖者", "两栖踪者", "魂人", "猎手大厅", "猎头流", "烈焰暴", "林法球", "林球", "灵动之翼", "灵魂归宿", "灵魂燃烧", "灵魂守卫", "灵魂行者", "灵魂之矛", "灵魂之猪", "灵陷阱", "灵之刃", "灵巧头巾", "灵守", "流浪法师斗篷", "流浪剑客", "流氓巫师", "留人", "卵盗贼", "卵主", "卵学徒", "卵战士", "破斩", "", "士", "心", "之男巫", "族血统", "落日酒", "洛萨", "洛萨之锋", "绿蜉蝣", "绿幼", "痹陷阱", "玛格娜托破坏者", "玛格娜托撕者", "玛格娜托战士", "妈奶崩", "马蹄踏", "玛维", "埋布地", "斯之手", "埋地", "买活", "斯琪女士", "买眼", "魅惑", "魅惑魔女", "魅惑遗物", "梅", "梅斯姆", "没有分", "梦境缠绕", "猛犸", "猛禽德伊", "猛禽之痕", "秘法", "秘法圣所", "秘法指环", "秘术异", "谜团", "秘锤", "秒逼", "秒", "秒秒射", "敏件", "敏捷便", "敏捷型", "冥界亚", "命令光环", "魔棒", "尔基安的章", "魔法垂饰", "魔法盗取权杖", "魔法盾", "魔法反", "魔法护盾", "魔法护盾护符", "魔法箭", "魔法结界", "魔法抗性", "魔法免疫", "魔法破坏者", "魔法", "魔法伤害", "魔法吮吸", "魔法吸收", "魔法药水", "魔法之球", "魔抗", "魔力法杖", "魔之心", "魔免", "魔瓶", "魔器传送", "末日使者", "末日守卫", "魔兽战队", "魔血球", "暮色酒", "娜", "娜海妖", "娜女海巫", "娜女海妖", "耐奥祖", "耐久光环", "鬼矿", "内面罩男", "垂饰", "之球", "之书", "你捡", "泥潭傀儡", "粘稠鼻液", "宁静之", "牛头", "牛头人", "牛头人酋长", "牛头人酋长凯恩血蹄", "牛头人图腾", "怒意狂击", "女猎流", "女猎手", "击炮小队", "拍拍熊", "什么", "撇锤", "撇斧", "撇斧子", "瓶色药水", "破法", "破法点灯", "破法者", "普通伤害", "乘鹰兽", "奇美拉栖木", "崎岖外表", "士加狮鹫", "强盗主", "强化图腾", "强化战鼓", "强击光环", "抢人头", "强杀", "强", "强甲", "敲地板", "清兵", "清晨酒", "青蜉蝣", "青幼", "穷鬼盾", "驱魔神符", "驱散", "驱散模范", "劝化", "全域静", "全士", "全屏沉", "全屏", "全图", "全知浮", "群魔缠", "群守卫", "群体传送", "群星坠落", "燃灰", "燃烧汽油", "绕树林", "热导弹", "刃甲", "人类联盟", "人类联盟区", "人品真好", "人仗熊势", "人族老农", "人族万油", "人族伀波流", "扔锤", "扔人", "日出酒", "盾", "山", "撒旦之力", "洒粉", "萨格拉斯之眼", "萨满", "萨满祭司", "赛特斯", "赛特斯之地狱使者", "赛特斯之暗舞者", "赛特斯之灵魂盗贼", "赛特斯之魔法师", "散华", "散华夜叉", "散失", "散失之刃", "三塔", "散夜", "散夜对剑", "森林巨魔", "森林之眼", "沙王", "避", "避护符", "电盾牌", "电箭阵", "电", "电咆哮", "电权杖", "电蜥蜴", "电幽魂", "电之球", "光弹", "山岭", "山岭巨人", "山丘之山", "山丘之王", "山丘之王穆拉丁", "烁突", "山王", "上单", "伤害加深", "赏猎人", "上", "上单", "上有符", "上有符", "烧魔", "棒", "棒子", "发魔女", "发女妖", "射击术", "女", "射手天赋", "神符", "神符上", "神符下", "神灵", "神灵武士", "神秘宝室", "神秘法杖", "神秘圣地", "神灭斩", "神牛", "神圣法杖", "神圣护甲", "神圣劝化", "神圣伤害", "神圣药水", "神圣之光", "深渊主", "深渊魔王", "神杖", "神之力", "神", "神流", "圣殿指环", "圣光", "升级狂战士", "圣剑", "生命护符", "生命回复", "生命手册", "生命吮吸", "生命吸取", "生命药水", "生命之泉", "圣", "圣士", "圣士乌瑟尔", "圣堂", "圣堂刺客", "圣物关口", "圣者遗物", "时光蜘", "石化凝", "时结界", "时漫游", "时锁定", "狮鹫笼", "狮鹫士", "人魔法师", "人魔力手套", "人魔魔法师", "人魔手套", "侍僧", "尸", "尸鬼", "尸鬼章", "尸鬼狂热", "尸鬼王章", "石头人", "尸王", "石像形态", "嗜血", "嗜血牛头流", "守地", "守护指环", "收尸体", "兽人步兵", "兽人地洞", "兽人斧", "守塔", "兽王", "守望者玛维", "手选", "受折磨的灵魂", "兽之狂暴", "兽族步兵", "兽族落", "兽族老农", "树根缠绕", "曙光酒", "树精卫士", "树魔级牧师", "树魔狂战士", "树魔猎手", "树魔", "树魔影子牧师", "术士", "属性点", "属性附加", "树眼", "赎罪", "刷新球", "刷", "双倍", "双倍攻击", "双倍攻击神符", "双倍神符", "霜冻护甲", "霜冻新星", "霜冻之箭", "霜冻之球", "双刃剑", "双头", "双头", "霜之新星", "双", "水晶阿卡瑟德", "水晶剑", "水晶室女", "水人", "四保伀", "斯嘉之眼", "撕伤口", "死灵", "死灵法", "死灵法师", "死灵", "死灵", "死灵书", "死", "死亡缠绕", "死亡凋", "死亡面具", "死亡面罩", "死亡士", "死亡士阿尔赛斯", "死亡守卫", "死亡先知", "死亡伀指", "死亡掌控", "速度卷轴", "速度神符", "速度之靴", "速推", "酸性喷", "酸性炸弹", "碎锤", "碎片攻击", "塔类图", "探测形", "弹射法杖", "淘汰之刃", "套套子", "逃脱匕", "提升力型", "天地鬼", "天地双鬼", "天神下凡", "天灾", "天灾军团的末日", "啊", "匀", "挑战头巾", "树枝干", "意头盔", "痛尖叫", "痛女王", "痛之源", "通灵塔", "头巾", "投矛", "透明鹿", "偷泉水", "投刃车", "偷塔", "投掷", "投掷镖", "屠夫", "屠夫去抓人", "图斯卡尔格斗者", "图斯卡尔猎人", "图斯卡尔男巫", "图斯卡尔枪兵", "图斯卡尔酋长", "图斯卡尔巫师", "图斯卡尔战士", "土熊猫", "团控", "化光环", "推塔", "推推杖", "推中", "吞噬", "吞噬魔法", "挖掘尸体", "万火焚", "亡灵的入侵", "亡灵法师", "亡灵巫师", "网住", "微恢复药水", "维拉德卖的赠品", "我单", "无敌暗猎人", "无敌暗舞者", "无敌狂暴者", "无敌斩", "巫毒商店", "无光之盾", "无甲", "无名恐怖者", "无名士", "无名死灵", "无虐不成长", "武器商人比泽", "巫师变者", "无地形", "无魔法免疫", "巫师学徒", "巫术之杖", "无维修费用", "巫妖", "巫妖克尔加德", "午夜凋", "午夜酒", "巫医", "无用挂件", "无缘无尽", "西尔瓦娜斯", "希梅斯特的掠夺", "牺牲深渊", "西瓦的守护", "希娃的守护", "希瓦的守护", "吸血光环", "吸血鬼的祭品", "吸血面具", "吸血药水", "蜥蜴怪物", "下单", "下有符", "下有符", "先锋盾", "陷阱守卫", "仙女", "先网", "显影之尘", "贤者", "先知", "相位", "相位转移", "小德", "小电锤", "小复活神符", "效果无魔法免疫", "小", "小回复卷轴", "小恢复药水", "小净化", "小净化药水", "小", "小", "小鹿", "消魔", "小魔棒", "小魔法神符", "小娜", "小炮", "小强蜘流", "小歪", "小小", "小丫", "小治疗神符", "小蜘", "恶光环", "恶狂热", "恶镰匀", "恶漫步者", "恶撒旦之力", "恶执著", "卸下尸体", "心灵之火", "新月之痕", "熊德", "熊怪萨满", "熊怪萨满长者", "熊怪", "熊怪乌萨战士", "熊怪踪者", "熊灵", "熊鹿", "熊鹿流", "熊猫酒仙", "熊形态", "熊战", "熊战士", "修补", "修补匠", "秀逗", "秀逗魔导士", "秀逗魔导师", "虚空", "虚空假面", "虚无宝石", "虚无状态", "玄冥盾牌", "血法师", "血精", "血精石", "穴居恶魔", "血魔", "血魔球", "血浴之母", "压兵线", "亚", "压人", "压线", "压制", "压制之刃", "岩石傀儡", "岩石印", "羊匀", "养人", "羊杖", "遥控炸弹", "摇瓶子", "妖术", "夜魔", "夜幕中的狩猎者", "兽幽魂", "液态火", "夜晚狩猎者", "性呼唤", "性之斧", "夜之酒", "伀拨", "伀波流", "医疗波", "医疗剂", "艺人面罩", "伀塔", "遗忘法师", "移形换位", "伀血", "啊", "刺", "匀", "神符", "药水", "形刺客", "阴影之狼", "硬化皮", "鹰弓", "影魔", "鹰女妖暴巫师", "鹰女妖流氓", "鹰女妖女皇", "鹰女妖巫婆", "攻击", "海", "影压", "勇头盔", "永恒之树", "永久", "捕", "幽鬼", "幽魂权杖", "幽灵系带", "幽灵之狼", "幽冥剧毒", "幽冥伀击", "游侠", "有眼", "玉蝴蝶流", "母蜘", "淤泥怪物", "淤泥投手", "淤泥战士", "鱼人", "鱼人守卫", "鱼人碎击", "圆盾", "古兵器", "古神灵", "古之树", "原始咆哮", "元素分离", "元素熊猫", "行", "月井", "月亮女祭祀", "月女", "月", "月神箭", "月神之箭", "月", "塔强杀", "月之女祭师泰兰德", "月之女祭司", "月之女祭祀", "月之士", "晕锤", "灾祸树人", "再填", "凿他", "怎么不换", "憎恶毁灭流", "炸弹人", "战斗嚎叫", "战歌之鼓", "战争古树", "战争踏", "战争傀儡", "战争磨坊", "召唤豪猪", "召唤师", "召唤树人", "召唤熊", "召唤熊灵", "召唤岩浆怪", "召唤战鹰", "召民兵", "招猪", "折光", "侦察守卫", "振奋", "振奋宝石", "振魂石", "真形态", "真", "真", "真宝石", "真实", "真眼", "正补", "汽坦克", "智慧披", "智慧之刃", "智力斗篷", "智力型", "治疗卷轴", "治疗喷", "治疗权仗", "治疗神符", "治疗守卫", "治疗指环", "命伀击", "支配头盔", "制图教学", "制图资源", "支援法衣", "蜘流", "忠考", "中单", "中和权杖", "击", "中立", "中", "中单", "中回来", "中消失", "众神", "众神之王", "中推", "主机刷", "网", "网怪女皇", "网怪", "网怪者", "网怪战士", "网怪织网者", "抓人", "专家级利爪德依练", "专家级灵魂行者练", "专家级猛禽德依练", "专家级牧师练", "专家级女巫练", "专家级女妖练", "专家级萨满练", "专家级亡灵巫师练", "专家级巫医练", "专注光环", "备唯伀", "踪术", "灼热之箭", "爆", "爆男", "动之火", "然之怒", "然之助", "紫怨", "紫怨之杖", "走位", "地", "栀后遗", "酒云"],
     * "wordBankName": "dota DOTA【官方推荐】",
     * "type": "魔兽争霸"
     * }
     * @throws Exception
     */
    public static JSONObject getDateFromSCEL(String path) throws Exception {
        JSONObject result = new JSONObject();
        File file = new File(path);
        FileInputStream input = new FileInputStream(file);
        byte[] str = new byte[128];
        Map<Integer, String> pyDic = new HashMap<Integer, String>();
        List<WordLibrary> pyAndWord = new ArrayList<WordLibrary>();

        byte[] num;
        int hzPosition = 0;
        input.read(str, 0, 128);

        if (str[4] == 0x44) {
            hzPosition = 0x2628;
        }
        if (str[4] == 0x45) {
            hzPosition = 0x26C4;
        }
        /********************字库名称开始**************************/
        input.getChannel().position(0x130);
        int lenc = input.read(str, 0, 128);
        System.out.println("字库名称:" + toString(str, lenc));
        result.put("wordBankName", toString(str, lenc));
        /********************字库名称结束*************************/


        /********************字库类别开始**************************/
        input.getChannel().position(0x338);
        lenc = input.read(str, 0, 128);
        System.out.println("字库类别:" + toString(str, lenc));
        result.put("type", toString(str, lenc));
        /********************字库类别结束*************************/

        /********************字库信息开始**************************/
//        input.getChannel().position(0x540);
//        lenc = input.read(str, 0, 128);
        //System.out.println("字库信息:" + toString(str,lenc));

        /********************字库信息结束*************************/

        /********************字库示例开始**************************/
//        input.getChannel().position(0xd40);
//        lenc = input.read(str, 0, 128);
        //System.out.println("字库示例:" + toString(str,lenc));

        /********************字库示例结束*************************/

        input.getChannel().position(0x1540);
        str = new byte[4];
        input.read(str, 0, 4);

        while (true) {
            num = new byte[4];
            input.read(num, 0, 4);
            int mark = num[0] + num[1] * 256;
            str = new byte[128];
            if (num[2] > 0) {
                input.read(str, 0, (num[2]));
                String py = new String(str, 0, num[2]);
                py = py.replaceAll("\0", "");
                pyDic.put(mark, py);
                if (py == "zuo") //最后一个拼音
                {
                    break;
                }
            } else {
                break;
            }
        }
        input.getChannel().position(hzPosition);
        int i = 0, count = 0, samePYcount = 0;
        while (true) {
            num = new byte[4];
            input.read(num, 0, 4);
            samePYcount = num[0] + num[1] * 256;
            count = num[2] + num[3] * 256;
            //接下来读拼音
            str = new byte[256];
            for (i = 0; i < count; i++) {
                str[i] = (byte) input.read();
            }
            String wordPY = "";
            for (i = 0; i < count / 2; i++) {
                int key = str[i * 2] + str[i * 2 + 1] * 256;
                wordPY += pyDic.get(key) + " ";
            }
            //接下来读词语
            for (int s = 0; s < samePYcount; s++) //同音词，使用前面相同的拼音
            {
                num = new byte[2];
                input.read(num, 0, 2);
                int hzBytecount = num[0] + num[1] * 256;
                str = new byte[hzBytecount];
                int len = input.read(str, 0, hzBytecount);
                String word = toString(str, len);
                pyAndWord.add(new WordLibrary(word, wordPY));
                byte[] temp = new byte[12];
                for (i = 0; i < 12; i++) {
                    temp[i] = (byte) input.read();
                }
            }
            if (file.length() == input.getChannel().position()) //判断文件结束
            {
                input.close();
                break;
            }
        }
        JSONArray data = new JSONArray();
        for (WordLibrary w : pyAndWord) {
            //System.out.println(w.getWord());
            data.add(w.getWord());
        }
        result.put("data", data);
        //System.out.println(result);
        return result;
    }

    /**
     * @param data
     * @return
     */
    public static String toString(byte[] data, int len) {
        StringBuffer strb = new StringBuffer();
        for (int ix = 0; ix < len; ix += 2) {
            if (data[ix + 1] <= 0 && data[ix] <= 0) {
                continue;
            }
            int d = data[ix] + data[ix + 1] * 256;
            if (data[ix] <= 0) {
                d = d + 256;
            }
            if (d != 0) {
                strb.append((char) d);
            }
        }
        return strb.toString();
    }
}

class WordLibrary {
    private int count = 1;
    private String[] pinYin;
    private String pinYinString = "";
    private String word;

    public WordLibrary(String word, String pinYinString) {
        this.word = word;
        this.pinYinString = pinYinString;
    }

    public int getCount() {
        return count;
    }

    public void setCount(int count) {
        this.count = count;
    }

    public String[] getPinYin() {
        return pinYin;
    }

    public void setPinYin(String[] pinYin) {
        this.pinYin = pinYin;
    }

    public String getPinYinString() {
        return pinYinString;
    }

    public void setPinYinString(String pinYinString) {
        this.pinYinString = pinYinString;
    }

    public String getWord() {
        return word;
    }

    public void setWord(String word) {
        this.word = word;
    }
}
